cases/square_Re150/coarse/Allrun
#!/usr/bin/env bash
set -euo pipefail

cd "$(dirname "$0")"

blockMesh > log.blockMesh 2>&1
checkMesh > log.checkMesh 2>&1

if [ -x /usr/bin/time ]; then
    /usr/bin/time -v pimpleFoam > log.pimpleFoam 2> log.time
else
    pimpleFoam > log.pimpleFoam 2>&1
fi
